// ####################################################
// ###               자판기 프로그램                ###
// ####################################################

// ----------------------------------------------------
// 동전 투입 : 10000
// ----------------------------------------------------
// 1. 콜라(700원) 2.사이다(600원) 3.커피 4.쥬스(1000원)
// ----------------------------------------------------
// 메뉴 선택 : 3
// ----------------------------------------------------
// 커피 크기 - 1.Tall(1500원), 2.Grande(2000원) : 1
// ----------------------------------------------------

// Tall 사이즈 커피가 나왔습니다.
// 잔돈은 8500원입니다.

#include <stdio.h>

int main()
{
	int valance;
	int menu;
	int size;

	printf("####################################################\n");
	printf("###               자판기 프로그램                ###\n");
	printf("####################################################\n\n");

	printf("----------------------------------------------------\n");
	printf("동전 투입 : ");
	scanf("%d", &valance);
	printf("----------------------------------------------------\n");
	printf("1. 콜라(700원) 2.사이다(600원) 3.커피 4.쥬스(1000원)\n");
	printf("----------------------------------------------------\n");
	printf("메뉴 선택 : ");
	scanf("%d", &menu);
	printf("----------------------------------------------------\n");

	if (menu == 1)
	{
		printf("콜라가 나왔습니다.\n");
		valance = valance - 700;
	}
	else if (menu == 2)
	{
		printf("사이다가 나왔습니다.\n");
		valance = valance - 600;
	}
	else if (menu == 3)
	{
		printf("커피 크기 - 1.Tall(1500원), 2.Grande(2000원) : ");
		scanf("%d", &size);
		printf("----------------------------------------------------\n");

		if (size == 1)
		{
			printf("Tall 사이즈 커피가 나왔습니다.\n");
			valance = valance - 1500;
		}
		else if (size == 2)
		{
			printf("Grande 사이즈 커피가 나왔습니다.\n");
			valance = valance - 2000;
		}
	}
	else if (menu == 4)
	{
		printf("쥬스가 나왔습니다.\n");
		valance = valance - 1000;
	}

	printf("잔돈은 %d원입니다.\n", valance);

	getch();

	return 0;
}

// ====================================
// 영화 티켓 프로그램
// ====================================
// 나이 입력 : 16
// 인원수 : 